"An error occurred. Please try again." = "Se produjo un error. Vuelve a intentarlo.";

"Card brand was not updated. Please try again." = "La marca de la tarjeta no se actualizó. Vuelve a intentarlo.";

"Close" = "Cerrar";

"Default payment method was not updated. Please try again." = "El método de pago predeterminado no se actualizó. Vuelve a intentarlo.";

"Scan Card" = "Escanear tarjeta";

"Scan card" = "Escanear tarjeta";

"The IBAN you entered is invalid." = "El IBAN que ingresaste no es válido.";

"There was an error processing your card -- try again in a few seconds" = "Hubo un error al procesar tu tarjeta. Vuelve a intentar en unos segundos.";

"There was an unexpected error -- try again in a few seconds" = "Se produjo un error inesperado. Vuelve a intentar en unos segundos.";

"Try again" = "Reintentar";

"We use Stripe to verify your card details. Stripe may use and store your data according its privacy policy. <a href='https://support.stripe.com/questions/stripes-card-image-verification'><u>Learn more</u></a>" = "Usamos Stripe para verificar los datos de tu tarjeta. Stripe puede usar y almacenar tus datos de acuerdo con la política de privacidad. <a href='https://support.stripe.com/questions/stripes-card-image-verification'><u>Más información</u></a>";

"Your card has expired" = "Tu tarjeta ha vencido.";

"Your card was declined" = "Tu tarjeta fue rechazada.";

"Your card's expiration month is invalid" = "El mes de vencimiento de tu tarjeta no es válido.";

"Your card's expiration year is invalid" = "El año de vencimiento de tu tarjeta no es válido";

"Your card's number is invalid" = "El número de tarjeta no es válido";

"Your card's security code is invalid" = "El código de seguridad de tu tarjeta no es válido.";

"Your name is invalid." = "El nombre no es válido.";

"Your payment method was declined." = "Tu método de pago fue rechazado.";
